run/slidingTest/system/blockMeshDict
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 format ascii;
 class dictionary;
 object blockMeshDict;
}

convertToMeters 1;

vertices
(
    (-100 0 0) // 0
    (100 0 0)   // 1
    (100 100 0)   // 2
    (-100 100 0)  // 3
    (-100 0 25) // 4
    (100 0 25)  // 5
    (100 100 25)  // 6
    (-100 100 25) // 7
);

blocks
  (
    hex

    (
      0
      1
      2
      3
      4
      5
      6
      7
    )
    (50 50 25)
    simpleGrading
    (1 1 1)
  );

boundary
  (
    frontAndBack

    {
      type patch;
      faces
        (

          (
            3
            7
            6
            2
          )

          (
            1
            5
            4
            0
          )
        );

    }
    inlet

    {
      type patch;
      faces
        (

          (
            0
            4
            7
            3
          )
        );

    }
    outlet

    {
      type patch;
      faces
        (

          (
            2
            6
            5
            1
          )
        );

    }
    lowerWall

    {
      type wall;
      faces
        (

          (
            0
            3
            2
            1
          )
        );

    }
    upperWall

    {
      type wall;
      faces
        (

          (
            4
            5
            6
            7
          )
        );

    }
  ); 	// ************************************************************************* //

